<?php
$this->set('title_for_layout', 'درباره ی من');
?>
<p class="aboutHeader">به نام دوست</p>
<div class="aboutAvatar"><?php echo $this->Html->image('myAvatar.png', array('alt' => 'آواتار من')); ?></div>
<p class="about">
	من <a href="http://noisy.ir/about/" alt="من کیستم؟" >مهدی علی خاصی </a> هستم، اهل اصفهان، شهر زیبای خدا.
    <br>
	یک طراح و توسعه دهنده ی وب که به تازگی فعالیت های خودم را در این حیطه شروع کرده ام.
    <br>
	بالاخره پس از مدت ها فرصتی پیش اومد و من هم به جمع بلاگ نویسان پیوستم، با بلاگ <a href="http://noisy.ir" alt="دست نوشته های یک تازه کار">دست نوشته های یک تازه کار</a>.
    <br>
	در باب مهارت ها و توانایی هام، اصلی ترین حوزه ی فعالیتم ،همین طراحی و توسعه ی وب هست که البته بیشتر توسعه ی وب میدهم تا طراحی وب. البته در این اواخر، به دلیل مشغله های درسی کمی از فعالیت هام کمتر شده و تصمیم گرفتم که فقط هر از گاهی یکم بلاگ نویسی کنم
    <br>
	مثل هر توسعه دهنده ی وب دیگر و مثل هر تازه کاری، با مهارت های HTML و CSS آشنایی دارم و تا حدودی میشه گفت که مسلط هستم بهشون و از ویژگی های HTML5 و CSS3 هم گاهی اوقات استفاده میکنم. با JavaScript هم اشنا هستم و از نوشتنش لذت میبرم اما زبان برنامه نویسی مورد علاقه و اصلی ام همان <a href="http://php.net">PHP</a> خودمان هست.
    <br>
	برای ساده تر کردن کارهایم هنگام طراحی و به عنوان یک فریم ورک php، گاهی دست به "آشپزی وب" با <a href="http://cakephp.com" alt="کیک پی اچ پی">CakePHP</a> میزنم و برای "نوشتن کمتر و انجام کار بیشتر" از فریم ورک محبوب <a href="http://jquery.com" alt="جی کوئری">JQuery</a> استفاده میکنم و یکی از Feature های اون که خیلی ازش خوشم میاد <a href="http://api.jquery.com/category/ajax/" alt="ای جکس">AJAX</a> اون هست. تا الان که فریم ورک PHP و فریم ورک JavaScript خودم را معرفی کردم. بریم سر فریم ورک CSS که برای اون هم از فریم ورک قدرتمند با امکانات بالای <a href="http://getbootstrap.com/" alt="بوت استراپ">Bootstrap</a> اگر نیاز باشه استفاده میکنم.
    <br>
	با CMF قدرتمند <a href="http://drupal.org" alt="دروپال">Drupal</a> هم آشنا هستم و چند سایتی را باهاش طراحی کردم و میکنم  و در کل از قدرت در عین سادگی اون و ساختار جالبش خوشم میاد
    <br>
	برای پایگاه های داده ی خودم هم در اکثر موارد از MySQL استفاده میکنم.
    <br>
	اگر فرصتی پیش بیاید هم به سمت <a href="http://symfony.com/" alt="سیمفونی">Symfony</a> خواهم رفت.
    <br>
	این ها از مهارت های وب بود، از این که بگذریم بد نیست سمت مهارت های لینوکسی هم بریم.
    <br>
	از اونجایی که زمینه ی اصلی فعالیت من وب هست، خوب قطعا با قسمت های مربوط به وب توی لینوکس مثل <a href="http://apache.org/" alt="آپاچی">Apache</a> و Apache2 و <a href="http://nginx.org/" alt="انجین ایکس">Nginx</a> و MySQL و Memcached و Fast-CGI و در کل به قول معروف با LAMP و LEMP و ... آشنا هستم و در کل چند سرور مجازی لینوکسی در دست بنده هست که آن هارا مدیریت میکنم.
    <br>
	بین سیستم عامل های لینوکس هم بیشتر با سیستم عامل های <a href="http://ubuntu.com" alt="اوبونتو">Ubuntu</a> یا <a href="https://www.centos.org/" alt="سنت او اس">CentOS</a> یا <a href="http://debian.net/" alt="دبیان">Debian</a> یا <a href="http://redhat.com/" alt="ردهت">RedHat</a> کار میکنم(مخصوصا <a href="http://www.ubuntu.com/download/server" alt="اوبونتو سرور">Ubuntu Server</a>)
    <br>
	آموزش های LPIC را گذرانده و اگر فرصتی شد در پی اخذ مدارک آن هستم.
    <br>
	اندک مدتی هم با موتور بازی سازی سه بعدی <a href="http://unity3d.com/" alt="موتور بازی یونیتی">Unity3D</a> هم کار کردم ولی به علت آن که ساخت بازی نیاز به کار گروهی دارد و به صورت تک نفری نزدیک به بعید است، و به علت مزید آن که فرد دیگری برای تشکیل تیم نیافتم آن را کنار گذاشتم.
    <br>
	و البته کمی هم در Flash و Visual Basic کار کرده ام ولی از آنجایی که با عقیده های Open Source من جور در نمی آمدند آن دو را هم به کناری گذاشتم.
    <br>
</p>
                            